package lessons.lesson04.homework

val v1 = 42
val v2 = 98765432123456789L
val v3 = 23.45f
val v4 = 0.123456789
val v5 = "Kotlin & Java"
// логический оператор в Boolean пишется строчными
// val v6 = FALSE
val v7 = 'c'
val v8 = 500
val v9 = 4294967296L
val v10 = 18.0f
val v11 = -0.001
val v12 = "OpenAI"
val v13 = "true"
val v14 = listOf(3, 14)
val v15 = '9'
val v16 = 2048
val v17 = 10000000000L
val v18 = setOf("OpenAI", "Quantum Computing")
val v19 = 5.75f
// в записи чисел не используются кавычки
// val v20 = `1.414`
val v21 = "Artificial Intelligence"
val v22 = arrayOf('x', "A")
val v23 = "Android Studio"
val v24 = '@'
val v25 = 1024
val v26 = 1234567890123L
val v27 = 10.01f
val v28 = -273.15
val v29 = "SpaceX"
// логический оператор в Boolean пишется строчными
// val v30 = FALSE
val v31 = 0.007
// используются кавычки другого типа
// val v32 = “🤯”
val v33 = mapOf("true" to 2, "false" to 34)
// в записи чисел не используются кавычки + не те кавычки + в одинарных кавычках может быть только 1 символ Char
// val v34 = ‘65535’
val v35 = 72057594037927935L
val v36 = 2.71828f
val v37 = 101.0101
val v38 = "Quantum Computing"
val v39 = mapOf(2 to "true", 34 to "false")
val v40 = 'x'
val v41 = 314
val v42 = 123456789123456789L
val v43 = 6.626f
//логический оператор в Boolean пишется строчными
// val v44 = TRUE

Подбери подходящий тип который будет:

Хранить букву, на которую указывает палец медиума во время спиритического сеанса. - Char
Хранить количество ложек сахара, которые я кладу в одну чашку чая. - Byte либог Float
Хранить список расходов на доставку еды, чтобы ещё раз убедиться, что готовить было дешевле. - List<Double>
Хранить длину очереди в столовой до миллиардной доли сантиметра. - Double
Хранить факт, закрыт ли баг после того, как его просто переименовали в фичу. - Boolean
Хранить количество свистков чайника за день. - Byte
Хранить количество нажатий котом на клавиатуру ноутбука за всё время твоей работы. - Int либо Long
Хранить количество попыток пересчитать звёзды на небе за всю историю человечества. - Long
Хранить массу воздуха в спускающем матрасе после нападения кота в долях грамма. - Double
Хранить словарь «название стартапа → сумму потерь инвесторов». Map<String, Double>
Хранить строку «починилось само», чтобы закрывать тикеты без лишних слов. - String
Хранить список тем для митингов, которые на самом деле никому не нужны. - List<String>